"use client"
// ======================== Imports ========================
import 'flowbite';
import React from 'react'
import AccordionCard from './AccordionCard';
import AnimatedElement from '@/components/Common/Animation/AnimatedElement';

export default function Accordion() {
    const AccordionData = [
        {
          title: "Ўқишга кимлар қабул қилинади?",
          description: "Умумтаълим мактаблари, ихтисослаштирилган мактаблар ҳамда махсус мактабларни 9-синифини ҳамда 11-синифини таъмомлаган ўқувчилар белгиланган тартибда ўқишга қабул қилинадилар."
        },
        {
          title: "Таълим олиш пулликми?",
          description: "Умумтаълим мактаблари, ихтисослаштирилган мактаблар ҳамда махсус мактабларни 9-синифини тамомлаган ўқувчилар 2 йиллик бепул таълим оладилар. 11-синифини тамомлаганлар белгиланган контракт тўловлари асосида таълим оладилар. Олий таълим, фан ва инновациялар вазирлиги томонидан белгилаб берилган айрим кундузги таълим босқичлари бепул амалга оширилади."
        },
        {
          title: "Таълим муассасасидаги қўшимча хизматлар пуллик йўлга қўйилганми?",
          description: "Таълим муассасасидаги барча қўшимча хизматлар, хусусан компьютер хоналаридан фойдаланиш, кутубхонадан фойдаланиш, фан ва касб тўгараклари, тил курслари ва ҳоказолар бепул йўлга қўйилган."
        },
        {
          title: "Таълим муассасасини тамомлагандан сўнг қандай ҳужжат берилади?",
          description: "Таълим муассасасини тамомлаган ўқувчиларга 3, 4 ва 5 даражадаги халқаро тан олинган давлат намунасидаги профессионал таълим дипломлари берилади."
        },
        {
          title: "Ўқишга қабул қилиш имтиҳон асосида амалга ошириладими?",
          description: "9 ва 11-синифни тамомлаган ўқувчилар таълим муассасасига суҳбат асосида қабул қилинади."
        },
        {
          title: "Таълим муассасасини тамомлагандан сўнг қандай имкониятлар мавжуд?",
          description: "Тамомлаганларга давлат намунасидаги диплом билан биргаликда белгиланган тартибда ҳайдовчилик гувоҳномаси олиш учун расмий ҳужжатлар тайёрланади, имтиҳонларга тайёргарлик кўрсатилади ва ўз мутахассисликлари бўйича ишга жойлаштирилади."
        },
        {
          title: "Ўқишга топшириш учун қандай ҳужжатлар талаб этилади?",
          description: "Аттестат, 2x4 ҳажмда 6 дона фотосурат, ота-онасининг паспорт нусҳалари ва тиббий маълумотнома."
        },
        {
          title: "9-синифни бир неча йил аввал тамомлаган ўқувчи ўқишга қабул қилинадими?",
          description: "Олий таълим, фан ва инновациялар вазирлигининг кўрсатмаларига асосан, 9-синифни бир неча йил аввал тамомлаган ўқувчилар ҳам ўқишга қабул қилинади."
        },
        {
          title: "Дарс машғулотлари қандай вақтларда олиб борилади?",
          description: "Ўқувчилар сонига қараб 1 ёки 2 сменада: 1-смена 13:30 гача, 2-смена 18:00 гача."
        },
        {
          title: "Таълим муассасасида кундузги, кечки ва сиртқи таълим шакллари мавжудми?",
          description: "2025–2026 ўқув йилида кундузги ва \"Дуал\" таълим йўлга қўйилган. Кечки ва сиртқи таълим шаклларини йўлга қўйиш режалаштирилган."
        }
      ];      

    return (
        <div className='mb-10'>
            <AnimatedElement>
                <h1 className="m-4 mb-10 text-3xl font-extrabold text-gray-900 dark:text-white md:text-4xl lg:text-5xl"><span className="text-transparent bg-clip-text bg-gradient-to-r to-blue-700 from-blue-400">| KO'P BERILADIGAN SAVOLLAR</span> :</h1>
            </AnimatedElement>
            {AccordionData.map((data, index) => (
                <AccordionCard key={index} title={data.title} description={data.description} />
            ))}
        </div>

    )
}
